tutorials/fluidSolidInteraction/wavesOnDam/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface    Aitken;

AitkenCoeffs
{
    // Solid interface patch list
    solidPatch interface;

    // Fluid interface patch list
    fluidPatch interface;

    // Fixed under-relaxation factor for first FSI iteration
    relaxationFactor 0.4;

    // Limit for enabling fluid mesh motion solver
    interfaceDeformationLimit 0;

    // FSI loop tolerance
    outerCorrTolerance 1e-6;

    // FSI max correctors
    nOuterCorr 20;

    interpolatorUpdateFrequency 0;
    // couplingReuse 0;

    // Enable FSI coupling
    coupled yes;
}

// ************************************************************************* //
